testTesults/stage_5/3_get_full_wrk.txt
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2692.070ms, rate sampling interval: 9371ms
  Thread calibration: mean lat.: 2705.176ms, rate sampling interval: 9322ms
  Thread calibration: mean lat.: 2655.554ms, rate sampling interval: 9379ms
  Thread calibration: mean lat.: 2679.181ms, rate sampling interval: 9306ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.78s     5.71s   25.66s    58.66%
    Req/Sec     1.49k    78.94     1.58k    60.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.24s 
 75.000%   20.66s 
 90.000%   23.20s 
 99.000%   25.40s 
 99.900%   25.62s 
 99.990%   25.67s 
 99.999%   25.67s 
100.000%   25.67s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5160.959     0.000000            3         1.00
    7397.375     0.100000        29679         1.11
    9797.631     0.200000        59352         1.25
   12378.111     0.300000        88997         1.43
   14327.807     0.400000       118724         1.67
   16244.735     0.500000       148346         2.00
   17137.663     0.550000       163200         2.22
   17924.095     0.600000       177943         2.50
   18825.215     0.650000       192905         2.86
   19693.567     0.700000       207610         3.33
   20660.223     0.750000       222421         4.00
   21102.591     0.775000       229998         4.44
   21528.575     0.800000       237475         5.00
   21938.175     0.825000       244738         5.71
   22364.159     0.850000       252187         6.67
   22773.759     0.875000       259754         8.00
   22986.751     0.887500       263336         8.89
   23199.743     0.900000       267031        10.00
   23412.735     0.912500       270625        11.43
   23658.495     0.925000       274556        13.33
   23920.639     0.937500       278031        16.00
   24100.863     0.943750       279975        17.78
   24330.239     0.950000       281841        20.00
   24559.615     0.956250       283671        22.86
   24788.991     0.962500       285626        26.67
   24920.063     0.968750       287339        32.00
   24985.599     0.971875       288236        35.56
   25067.519     0.975000       289203        40.00
   25133.055     0.978125       290070        45.71
   25214.975     0.981250       291209        53.33
   25280.511     0.984375       292072        64.00
   25313.279     0.985938       292655        71.11
   25346.047     0.987500       293023        80.00
   25378.815     0.989062       293491        91.43
   25395.199     0.990625       293905       106.67
   25427.967     0.992188       294272       128.00
   25460.735     0.992969       294687       142.22
   25477.119     0.993750       295026       160.00
   25477.119     0.994531       295026       182.86
   25493.503     0.995313       295185       213.33
   25526.271     0.996094       295509       256.00
   25542.655     0.996484       295586       284.44
   25559.039     0.996875       295797       320.00
   25559.039     0.997266       295797       365.71
   25575.423     0.997656       295971       426.67
   25591.807     0.998047       296166       512.00
   25591.807     0.998242       296166       568.89
   25591.807     0.998437       296166       640.00
   25591.807     0.998633       296166       731.43
   25624.575     0.998828       296258       853.33
   25640.959     0.999023       296353      1024.00
   25640.959     0.999121       296353      1137.78
   25640.959     0.999219       296353      1280.00
   25640.959     0.999316       296353      1462.86
   25657.343     0.999414       296501      1706.67
   25657.343     0.999512       296501      2048.00
   25657.343     0.999561       296501      2275.56
   25657.343     0.999609       296501      2560.00
   25657.343     0.999658       296501      2925.71
   25657.343     0.999707       296501      3413.33
   25657.343     0.999756       296501      4096.00
   25657.343     0.999780       296501      4551.11
   25657.343     0.999805       296501      5120.00
   25673.727     0.999829       296554      5851.43
   25673.727     1.000000       296554          inf
#[Mean    =    15782.229, StdDeviation   =     5711.131]
#[Max     =    25657.344, Total count    =       296554]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  344625 requests in 1.00m, 39.97MB read
Requests/sec:   5743.77
Transfer/sec:    682.15KB
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2694.323ms, rate sampling interval: 8634ms
  Thread calibration: mean lat.: 2729.953ms, rate sampling interval: 8650ms
  Thread calibration: mean lat.: 2721.402ms, rate sampling interval: 8716ms
  Thread calibration: mean lat.: 2732.508ms, rate sampling interval: 8699ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.64s     9.35s   36.86s    57.21%
    Req/Sec     0.90k    29.42     0.95k    45.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.66s 
 75.000%   28.75s 
 90.000%   33.82s 
 99.000%   36.57s 
 99.900%   36.83s 
 99.990%   36.90s 
 99.999%   36.90s 
100.000%   36.90s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4825.087     0.000000            3         1.00
    7671.807     0.100000        17980         1.11
   10895.359     0.200000        35968         1.25
   14016.511     0.300000        53938         1.43
   17219.583     0.400000        71914         1.67
   20660.223     0.500000        89894         2.00
   22233.087     0.550000        98954         2.22
   23805.951     0.600000       107959         2.50
   25329.663     0.650000       116904         2.86
   26902.527     0.700000       125857         3.33
   28753.919     0.750000       134846         4.00
   29851.647     0.775000       139368         4.44
   30507.007     0.800000       143867         5.00
   31195.135     0.825000       148326         5.71
   32079.871     0.850000       152817         6.67
   32866.303     0.875000       157366         8.00
   33308.671     0.887500       159601         8.89
   33816.575     0.900000       161894        10.00
   34209.791     0.912500       164077        11.43
   34635.775     0.925000       166344        13.33
   35028.991     0.937500       168650        16.00
   35192.831     0.943750       169727        17.78
   35389.439     0.950000       170983        20.00
   35553.279     0.956250       172036        22.86
   35717.119     0.962500       173144        26.67
   35880.959     0.968750       174186        32.00
   35946.495     0.971875       174725        35.56
   36044.799     0.975000       175410        40.00
   36143.103     0.978125       175943        45.71
   36274.175     0.981250       176471        53.33
   36372.479     0.984375       177025        64.00
   36405.247     0.985938       177261        71.11
   36470.783     0.987500       177533        80.00
   36536.319     0.989062       177884        91.43
   36601.855     0.990625       178247       106.67
   36634.623     0.992188       178463       128.00
   36667.391     0.992969       178702       142.22
   36667.391     0.993750       178702       160.00
   36700.159     0.994531       178961       182.86
   36700.159     0.995313       178961       213.33
   36732.927     0.996094       179180       256.00
   36732.927     0.996484       179180       284.44
   36765.695     0.996875       179359       320.00
   36765.695     0.997266       179359       365.71
   36765.695     0.997656       179359       426.67
   36798.463     0.998047       179513       512.00
   36798.463     0.998242       179513       568.89
   36798.463     0.998437       179513       640.00
   36831.231     0.998633       179673       731.43
   36831.231     0.998828       179673       853.33
   36831.231     0.999023       179673      1024.00
   36831.231     0.999121       179673      1137.78
   36831.231     0.999219       179673      1280.00
   36831.231     0.999316       179673      1462.86
   36831.231     0.999414       179673      1706.67
   36863.999     0.999512       179748      2048.00
   36863.999     0.999561       179748      2275.56
   36863.999     0.999609       179748      2560.00
   36863.999     0.999658       179748      2925.71
   36863.999     0.999707       179748      3413.33
   36863.999     0.999756       179748      4096.00
   36863.999     0.999780       179748      4551.11
   36863.999     0.999805       179748      5120.00
   36863.999     0.999829       179748      5851.43
   36896.767     0.999854       179775      6826.67
   36896.767     1.000000       179775          inf
#[Mean    =    20641.031, StdDeviation   =     9347.438]
#[Max     =    36864.000, Total count    =       179775]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  231484 requests in 1.00m, 26.80MB read
Requests/sec:   3858.08
Transfer/sec:    457.32KB
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 3238.370ms, rate sampling interval: 12001ms
  Thread calibration: mean lat.: 3251.572ms, rate sampling interval: 12140ms
  Thread calibration: mean lat.: 3271.621ms, rate sampling interval: 12083ms
  Thread calibration: mean lat.: 3286.814ms, rate sampling interval: 12091ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.57s     9.29s   38.99s    57.58%
    Req/Sec     0.89k    23.15     0.92k    62.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.30s 
 75.000%   30.59s 
 90.000%   35.65s 
 99.000%   38.60s 
 99.900%   38.93s 
 99.990%   39.03s 
 99.999%   39.03s 
100.000%   39.03s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6742.015     0.000000            5         1.00
    9912.319     0.100000        17889         1.11
   12984.319     0.200000        35756         1.25
   16146.431     0.300000        53559         1.43
   19169.279     0.400000        71405         1.67
   22298.623     0.500000        89260         2.00
   23920.639     0.550000        98240         2.22
   25591.807     0.600000       107137         2.50
   27262.975     0.650000       116040         2.86
   28917.759     0.700000       125029         3.33
   30588.927     0.750000       133942         4.00
   31457.279     0.775000       138344         4.44
   32342.015     0.800000       142840         5.00
   33128.447     0.825000       147274         5.71
   34013.183     0.850000       151830         6.67
   34799.615     0.875000       156305         8.00
   35192.831     0.887500       158483         8.89
   35651.583     0.900000       160868        10.00
   36110.335     0.912500       162952        11.43
   36503.551     0.925000       165221        13.33
   36863.999     0.937500       167380        16.00
   37060.607     0.943750       168511        17.78
   37289.983     0.950000       169674        20.00
   37486.591     0.956250       170709        22.86
   37748.735     0.962500       171878        26.67
   37945.343     0.968750       173029        32.00
   38043.647     0.971875       173620        35.56
   38109.183     0.975000       174064        40.00
   38207.487     0.978125       174602        45.71
   38338.559     0.981250       175285        53.33
   38436.863     0.984375       175847        64.00
   38469.631     0.985938       176001        71.11
   38535.167     0.987500       176405        80.00
   38567.935     0.989062       176673        91.43
   38600.703     0.990625       176832       106.67
   38666.239     0.992188       177163       128.00
   38699.007     0.992969       177366       142.22
   38731.775     0.993750       177588       160.00
   38731.775     0.994531       177588       182.86
   38764.543     0.995313       177735       213.33
   38797.311     0.996094       177922       256.00
   38797.311     0.996484       177922       284.44
   38830.079     0.996875       178016       320.00
   38830.079     0.997266       178016       365.71
   38862.847     0.997656       178123       426.67
   38895.615     0.998047       178210       512.00
   38895.615     0.998242       178210       568.89
   38895.615     0.998437       178210       640.00
   38928.383     0.998633       178317       731.43
   38928.383     0.998828       178317       853.33
   38928.383     0.999023       178317      1024.00
   38961.151     0.999121       178401      1137.78
   38961.151     0.999219       178401      1280.00
   38961.151     0.999316       178401      1462.86
   38961.151     0.999414       178401      1706.67
   38961.151     0.999512       178401      2048.00
   38993.919     0.999561       178428      2275.56
   38993.919     0.999609       178428      2560.00
   38993.919     0.999658       178428      2925.71
   39026.687     0.999707       178482      3413.33
   39026.687     1.000000       178482          inf
#[Mean    =    22565.998, StdDeviation   =     9285.407]
#[Max     =    38993.920, Total count    =       178482]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  211051 requests in 1.00m, 24.42MB read
Requests/sec:   3517.27
Transfer/sec:    416.79KB